# -*- coding: utf-8 -*-
"""
Задание 1.6

Написать тест(ы), который проверяет находятся ли все интерфейсы, которые
указаны в файле net_interfaces_up.yaml в состоянии up (например, столбец Protocol в выводе sh ip int br).

Для проверки надо подключиться к каждому маршрутизатору с помощью scrapli/netmiko
и проверить маршрут командой sh ip route или разновидностью команды sh ip route.

Тест(ы) должен проходить, если все интерфейсы из файла net_interfaces_up.yaml в состоянии up.
Тест может быть один или несколько.

Тест(ы) написать в файле задания.

Для заданий этого раздела нет тестов для проверки тестов :)
"""
